runchip/zephyr-cc3220/ext/hal/ti/simplelink/source/ti/drivers/crypto/CryptoCC32XX.c
/*
 * Copyright (c) 2015-2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

/*
 * By default disable both asserts and log for this module.
 * This must be done before DebugP.h is included.
 */
#ifndef DebugP_ASSERT_ENABLED
#define DebugP_ASSERT_ENABLED 0
#endif
#ifndef DebugP_LOG_ENABLED
#define DebugP_LOG_ENABLED 0
#endif

#include <ti/drivers/dpl/DebugP.h>
#include <ti/drivers/dpl/ClockP.h>
#include <ti/drivers/dpl/HwiP.h>
#include <ti/drivers/dpl/SemaphoreP.h>

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC32XX.h>

#include <ti/drivers/crypto/CryptoCC32XX.h>

#include <ti/devices/cc32xx/inc/hw_types.h>
#include <ti/devices/cc32xx/inc/hw_ints.h>
#include <ti/devices/cc32xx/inc/hw_memmap.h>
#include <ti/devices/cc32xx/driverlib/rom.h>
#include <ti/devices/cc32xx/driverlib/rom_map.h>
#include <ti/devices/cc32xx/driverlib/aes.h>
#include <ti/devices/cc32xx/driverlib/des.h>
#include <ti/devices/cc32xx/driverlib/shamd5.h>
#include <ti/devices/cc32xx/driverlib/prcm.h>


#define CryptoCC32XX_SHAMD5_SIGNATURE_LEN_MD5       16
#define CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA1      20
#define CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA224    28
#define CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA256    32

#define CryptoCC32XX_CONTEXT_READY_MAX_COUNTER      1000

#define CryptoCC32XX_SHAMD5GetSignatureSize(_mode) (((_mode == SHAMD5_ALGO_MD5)     ||(_mode == SHAMD5_ALGO_HMAC_MD5))      ?   CryptoCC32XX_SHAMD5_SIGNATURE_LEN_MD5:      \
                                                    ((_mode == SHAMD5_ALGO_SHA1)    ||(_mode == SHAMD5_ALGO_HMAC_SHA1))     ?   CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA1:     \
                                                    ((_mode == SHAMD5_ALGO_SHA224)  ||(_mode == SHAMD5_ALGO_HMAC_SHA224))   ?   CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA224:   \
                                                    ((_mode == SHAMD5_ALGO_SHA256)  ||(_mode == SHAMD5_ALGO_HMAC_SHA256))   ?   CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA256:0)

#define SHAMD5_SIGNATURE_MAX_LEN    CryptoCC32XX_SHAMD5_SIGNATURE_LEN_SHA256
typedef int8_t CryptoCC32XX_SHAMD5Signature[SHAMD5_SIGNATURE_MAX_LEN];

typedef struct CryptoCC32XX_HwiP {
    /*! Crypto Peripheral's interrupt handler */
    HwiP_Fxn    hwiIntFxn;
    /*! Crypto Peripheral's interrupt vector */
    uint32_t    intNum;
    /*! Crypto Peripheral's interrupt priority */
    uint32_t    intPriority;
} CryptoCC32XX_HwiP;

/* Prototypes */
int32_t         CryptoCC32XX_aesProcess(uint32_t cryptoMode , uint32_t cryptoDirection, uint8_t* pInBuff, uint16_t inLen, uint8_t* pOutBuff , CryptoCC32XX_EncryptParams* pParams);
int32_t         CryptoCC32XX_desProcess(uint32_t cryptoMode , uint32_t cryptoDirection, uint8_t* pInBuff, uint16_t inLen, uint8_t* pOutBuff , CryptoCC32XX_EncryptParams* pParams);
int32_t         CryptoCC32XX_shamd5Process(uint32_t cryptoMode , uint8_t* pBuff, uint16_t len, uint8_t *pSignature, CryptoCC32XX_HmacParams* pParams);
void            CryptoCC32XX_aesIntHandler(void);
void            CryptoCC32XX_desIntHandler(void);
void            CryptoCC32XX_shamd5IntHandler(void);
HwiP_Handle     CryptoCC32XX_register(CryptoCC32XX_Handle handle, CryptoCC32XX_HwiP *hwiP);
void            CryptoCC32XX_unregister(HwiP_Handle handle);


/* Crypto CC32XX interrupts implementation */
CryptoCC32XX_HwiP CryptoCC32XX_HwiPTable[] = {
    { (HwiP_Fxn)CryptoCC32XX_aesIntHandler,     INT_AES, (~0) },    /* AES */
    { (HwiP_Fxn)CryptoCC32XX_desIntHandler,     INT_DES, (~0) },    /* DES */
    { (HwiP_Fxn)CryptoCC32XX_shamd5IntHandler,  INT_SHA, (~0) }     /* SHAMD5 */
};

/* Crypto AES key size to Crypto CC32XX AES key size */
#define CryptoCC32XX_getAesKeySize(_keySize) (                                  \
    (_keySize == CryptoCC32XX_AES_KEY_SIZE_128BIT)? AES_CFG_KEY_SIZE_128BIT:    \
    (_keySize == CryptoCC32XX_AES_KEY_SIZE_192BIT)? AES_CFG_KEY_SIZE_192BIT:    \
    (_keySize == CryptoCC32XX_AES_KEY_SIZE_256BIT)? AES_CFG_KEY_SIZE_256BIT:    \
    CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED)

/* Crypto DES key size to Crypto CC32XX DES key size */
#define CryptoCC32XX_getDesKeySize(_keySize) (                              \
    (_keySize == CryptoCC32XX_DES_KEY_SIZE_SINGLE)? DES_CFG_SINGLE:         \
    (_keySize == CryptoCC32XX_DES_KEY_SIZE_TRIPLE)? DES_CFG_TRIPLE:         \
    CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED)

/* Crypto method to Crypto CC32XX mode */
#define CryptoCC32XX_getMode(_method) (                              \
    (_method == CryptoCC32XX_AES_ECB)?        AES_CFG_MODE_ECB:            \
    (_method == CryptoCC32XX_AES_CBC)?        AES_CFG_MODE_CBC:            \
    (_method == CryptoCC32XX_AES_CTR)?        AES_CFG_MODE_CTR:            \
    (_method == CryptoCC32XX_AES_ICM)?        AES_CFG_MODE_ICM:            \
    (_method == CryptoCC32XX_AES_CFB)?        AES_CFG_MODE_CFB:            \
    (_method == CryptoCC32XX_AES_GCM)?        AES_CFG_MODE_GCM_HY0CALC:    \
    (_method == CryptoCC32XX_AES_CCM)?        AES_CFG_MODE_CCM:            \
    (_method == CryptoCC32XX_DES_ECB)?        DES_CFG_MODE_ECB:            \
    (_method == CryptoCC32XX_DES_CBC)?        DES_CFG_MODE_CBC:            \
    (_method == CryptoCC32XX_DES_CFB)?        DES_CFG_MODE_CFB:            \
    (_method == CryptoCC32XX_HMAC_MD5)?       SHAMD5_ALGO_HMAC_MD5:        \
    (_method == CryptoCC32XX_HMAC_SHA1)?      SHAMD5_ALGO_HMAC_SHA1:       \
    (_method == CryptoCC32XX_HMAC_SHA224)?    SHAMD5_ALGO_HMAC_SHA224:     \
    (_method == CryptoCC32XX_HMAC_SHA256)?    SHAMD5_ALGO_HMAC_SHA256:     \
    CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED)


