runchip/zephyr-cc3220/ext/hal/ti/simplelink/source/ti/drivers/crypto/CryptoCC32XX.c
/* global variables for the interrupt handles */
static volatile bool g_bAESReadyFlag;
static volatile bool g_bDESReadyFlag;
static volatile bool g_bSHAMD5ReadyFlag;

/* Externs */
extern const CryptoCC32XX_Config CryptoCC32XX_config[];
extern const uint8_t CryptoCC32XX_count;


/*
 *  ======== CryptoCC32XX_close ========
 */
void CryptoCC32XX_close(CryptoCC32XX_Handle handle)
{
    uintptr_t                   key;
    CryptoCC32XX_Object         *object = handle->object;
    int32_t type;

    /* Mask Crypto interrupts */


    /* Power off the Crypto module */
    Power_releaseDependency(PowerCC32XX_PERIPH_DTHE);

    for (type = 0; type  < CryptoCC32XX_MAX_TYPES;type++)
    {
        if (object->sem[type] != NULL)
        {
            SemaphoreP_delete(object->sem[type]);
        }
        if (object->hwiHandle[type] != NULL)
        {
            CryptoCC32XX_unregister(object->hwiHandle[type]);
        }
   }

    /* Mark the module as available */
    key = HwiP_disable();

    object->isOpen = false;

    HwiP_restore(key);

    return;
}


/*
 *  ======== CryptoCC32XX_init ========
 */
void CryptoCC32XX_init(void)
{
}

/*
 *  ======== CryptoCC32XX_open ========
 */
CryptoCC32XX_Handle CryptoCC32XX_open(uint32_t index, uint32_t types)
{
    CryptoCC32XX_Handle       handle;
    uintptr_t                 key;
    CryptoCC32XX_Object       *object;
    SemaphoreP_Params         semParams;
    int32_t type;


    if (index >= CryptoCC32XX_count)
    {
        return (NULL);
    }

    /* Get handle for this driver instance */
    handle = (CryptoCC32XX_Handle)&(CryptoCC32XX_config[index]);
    object = handle->object;

    /* Determine if the device index was already opened */
    key = HwiP_disable();
    if(object->isOpen == true)
    {
        HwiP_restore(key);
        return (NULL);
    }

    /* Mark the handle as being used */
    object->isOpen = true;
    HwiP_restore(key);

    /* Power on the Crypto module */
    Power_setDependency(PowerCC32XX_PERIPH_DTHE);
    MAP_PRCMPeripheralReset(PRCM_DTHE);

    /* create the semaphore for each crypto type*/
    SemaphoreP_Params_init(&semParams);
    semParams.mode = SemaphoreP_Mode_BINARY;
    for (type=0 ;type < CryptoCC32XX_MAX_TYPES; type++)
    {
        if ((types & (1<<type)) != 0)
        {
            object->sem[type] = SemaphoreP_create(1, &semParams);
            if (object->sem[type] == NULL)
            {
                CryptoCC32XX_close(handle);
                return (NULL);
            }
            /* interrupt handler */
            object->hwiHandle[type] = CryptoCC32XX_register(handle,&CryptoCC32XX_HwiPTable[type]);
            if (object->hwiHandle[type] == NULL)
            {
                CryptoCC32XX_close(handle);
                return (NULL);
            }
        }
        else
        {
            object->sem[type] = NULL;
        }
    }
    /* Return the address of the handle */
    return (handle);
}

/*
 *  ======== CryptoCC32XX_encrypt ========
 */
int32_t CryptoCC32XX_encrypt(CryptoCC32XX_Handle handle, CryptoCC32XX_EncryptMethod method , void *pInBuff, size_t inLen, void *pOutBuff , size_t *outLen , CryptoCC32XX_EncryptParams *pParams)
{
    CryptoCC32XX_Object     *object = handle->object;
    uint8_t cryptoType = method >> 8;
    uint32_t cryptoMode = CryptoCC32XX_getMode((uint32_t)method);
    int32_t status = CryptoCC32XX_STATUS_ERROR;
    /* Convert crypto type bitwise to index */
    uint8_t cryptoIndex = cryptoType >> 1;

    /* check semaphore created  */
    if (object->sem[cryptoIndex] == NULL)
    {
        return CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED;
    }
    /* get the semaphore */
    if (SemaphoreP_OK == SemaphoreP_pend(object->sem[cryptoIndex],
                SemaphoreP_WAIT_FOREVER))
    {
        switch (cryptoType)
        {
            case CryptoCC32XX_AES:
                status = CryptoCC32XX_aesProcess(cryptoMode , AES_CFG_DIR_ENCRYPT, pInBuff, inLen, pOutBuff , pParams);
            break;
            case CryptoCC32XX_DES:
                status = CryptoCC32XX_desProcess(cryptoMode , DES_CFG_DIR_ENCRYPT, pInBuff, inLen, pOutBuff , pParams);
            break;
            default:
            break;
        }

        /* release the semaphore */
        SemaphoreP_post(object->sem[cryptoIndex]);
    }
    return status;
}

/*
 *  ======== CryptoCC32XX_decrypt ========
 */
int32_t CryptoCC32XX_decrypt(CryptoCC32XX_Handle handle, CryptoCC32XX_EncryptMethod method , void *pInBuff, size_t inLen, void *pOutBuff , size_t *outLen , CryptoCC32XX_EncryptParams *pParams)
{
    CryptoCC32XX_Object     *object = handle->object;
    uint8_t cryptoType =  method >> 8;
    uint32_t cryptoMode = CryptoCC32XX_getMode((uint32_t)method);
    int32_t status = CryptoCC32XX_STATUS_ERROR;
    /* Convert crypto type bitwise to index */
    uint8_t cryptoIndex = cryptoType >> 1;

    /* check semaphore created  */
    if (object->sem[cryptoIndex] == NULL)
    {
        return CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED;
    }
    /* get the semaphore */
    if (SemaphoreP_OK == SemaphoreP_pend(object->sem[cryptoIndex],
                SemaphoreP_WAIT_FOREVER))
    {
        switch (cryptoType)
        {
            case CryptoCC32XX_AES:
                status = CryptoCC32XX_aesProcess(cryptoMode , AES_CFG_DIR_DECRYPT, pInBuff, inLen, pOutBuff , pParams);
            break;
            case CryptoCC32XX_DES:
                status = CryptoCC32XX_desProcess(cryptoMode , DES_CFG_DIR_DECRYPT, pInBuff, inLen, pOutBuff , pParams);
            break;
            default:
            break;
        }
        /* release the semaphore */
        SemaphoreP_post(object->sem[cryptoIndex]);
    }
    return status;
}


/*
 *  ======== CryptoCC32XX_sign ========
 */
int32_t CryptoCC32XX_sign(CryptoCC32XX_Handle handle, CryptoCC32XX_HmacMethod method , void *pBuff, size_t len, uint8_t *pSignature, CryptoCC32XX_HmacParams *pParams)
{
    CryptoCC32XX_Object     *object = handle->object;
    uint8_t cryptoType = CryptoCC32XX_HMAC;
    uint32_t cryptoMode = CryptoCC32XX_getMode((uint32_t)method);
    int32_t status = CryptoCC32XX_STATUS_ERROR;
    /* Convert crypto type bitwise to index */
    uint8_t cryptoIndex = cryptoType >> 1;

    /* check semaphore created  */
    if (object->sem[cryptoIndex] == NULL)
    {
        return CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED;
    }
    /* get the semaphore */
    if (SemaphoreP_OK == SemaphoreP_pend(object->sem[cryptoIndex],
                SemaphoreP_WAIT_FOREVER))
    {
        switch (cryptoType)
        {
            case CryptoCC32XX_HMAC:
                if (pParams->pKey == NULL)
                {
                     /* change mode to none HMAC */
                     cryptoMode |= SHAMD5_ALGO_MD5;
                }
                status = CryptoCC32XX_shamd5Process(cryptoMode , pBuff, len, pSignature , pParams);
            break;
            default:
            break;
        }
        /* release the semaphore */
        SemaphoreP_post(object->sem[cryptoIndex]);
    }
    return status;
}

