runchip/zephyr-cc3220/ext/hal/ti/simplelink/source/ti/drivers/crypto/CryptoCC32XX.c
/*
 *  ======== CryptoCC32XX_verify ========
 */
int32_t CryptoCC32XX_verify(CryptoCC32XX_Handle handle, CryptoCC32XX_HmacMethod method , void *pBuff, size_t len, uint8_t *pSignature, CryptoCC32XX_HmacParams *pParams)
{
    CryptoCC32XX_Object     *object = handle->object;
    uint8_t cryptoType = CryptoCC32XX_HMAC;
    uint32_t cryptoMode = CryptoCC32XX_getMode((uint32_t)method);
    int32_t status = CryptoCC32XX_STATUS_ERROR;
    uint16_t shamd5SignatureSize;
    CryptoCC32XX_SHAMD5Signature shamd5Signature;
    /* Convert crypto type bitwise to index */
    uint8_t cryptoIndex = cryptoType >> 1;

    /* check semaphore created  */
    if (object->sem[cryptoIndex] == NULL)
    {
        return CryptoCC32XX_STATUS_ERROR_NOT_SUPPORTED;
    }
    /* get the semaphore */
    if (SemaphoreP_OK == SemaphoreP_pend(object->sem[cryptoIndex],
                SemaphoreP_WAIT_FOREVER))
    {
        switch (cryptoType)
        {
            case CryptoCC32XX_HMAC:
                shamd5SignatureSize = CryptoCC32XX_SHAMD5GetSignatureSize(cryptoMode);
                if (shamd5SignatureSize > 0)
                {
                    if (pParams->pKey == NULL)
                    {
                         /* change mode to none HMAC */
                         cryptoMode |= SHAMD5_ALGO_MD5;
                    }
                    /* save the received signature */
                    memcpy(shamd5Signature,pSignature,shamd5SignatureSize);
                    /* calculate the signature */
                    status = CryptoCC32XX_shamd5Process(cryptoMode , pBuff, len, pSignature , pParams);
                    /* compare the calculated signature to the received signature */
                    if (status == CryptoCC32XX_STATUS_SUCCESS)
                    {
                        if (memcmp(shamd5Signature,pSignature,shamd5SignatureSize) != 0)
                        {
                            status = CryptoCC32XX_STATUS_ERROR_VERIFY;
                        }
                    }
                }
            break;
            default:
            break;
        }
        /* release the semaphore */
        SemaphoreP_post(object->sem[cryptoIndex]);
    }
    return status;
}

/*
 *  ======== CryptoCC32XX_shamd5Process ========
 */
int32_t CryptoCC32XX_shamd5Process(uint32_t cryptoMode , uint8_t *pBuff, uint16_t len, uint8_t *pSignature, CryptoCC32XX_HmacParams *pParams)
{
    int32_t count = CryptoCC32XX_CONTEXT_READY_MAX_COUNTER;
    /*
    Step1: Enable Interrupts
    Step2: Wait for Context Ready Interrupt
    Step3: Set the Configuration Parameters (Hash Algorithm)
    Step4: Set Key
    Step5: Start Hash Generation
    */

    if (pParams->moreData == 0)
    {
        /* Clear the flag */
        g_bSHAMD5ReadyFlag = false;

        /* Enable interrupts. */
        MAP_SHAMD5IntEnable(SHAMD5_BASE, SHAMD5_INT_CONTEXT_READY |
                        SHAMD5_INT_PARTHASH_READY |
                        SHAMD5_INT_INPUT_READY |
                        SHAMD5_INT_OUTPUT_READY);

        /* Wait for the context ready flag. */
        while ((!g_bSHAMD5ReadyFlag) && (count > 0))
        {
            count --;
        }
        if (count == 0)
        {
            return CryptoCC32XX_STATUS_ERROR;
        }

        /* Configure the SHA/MD5 module. */
        MAP_SHAMD5ConfigSet(SHAMD5_BASE, cryptoMode);

        /* If Keyed Hashing is used, Set Key and start Hash Generation */
        if (pParams->pKey != NULL)
        {
            MAP_SHAMD5HMACKeySet(SHAMD5_BASE, pParams->pKey);
        }
    }

    /* Perform the hashing operation */
    MAP_SHAMD5HMACProcess(SHAMD5_BASE, pBuff, len, pSignature);

    return CryptoCC32XX_STATUS_SUCCESS;
}

/*
 *  ======== CryptoCC32XX_aesProcess ========
 */
int32_t CryptoCC32XX_aesProcess(uint32_t cryptoMode , uint32_t cryptoDirection, uint8_t *pInBuff, uint16_t inLen, uint8_t *pOutBuff , CryptoCC32XX_EncryptParams *pParams)
{
    int32_t count = CryptoCC32XX_CONTEXT_READY_MAX_COUNTER;
    /*
    Step1:  Enable Interrupts
    Step2:  Wait for Context Ready Interrupt
    Step3:  Set the Configuration Parameters (Direction,AES Mode and Key Size)
    Step4:  Set the Initialization Vector
    Step5:  Write Key
    Step6:  Start the Crypt Process
    */

    /* Clear the flag. */
    g_bAESReadyFlag = false;

    /* Enable all interrupts. */
    MAP_AESIntEnable(AES_BASE, AES_INT_CONTEXT_IN | AES_INT_CONTEXT_OUT | AES_INT_DATA_IN | AES_INT_DATA_OUT);

    /* Wait for the context in flag, the flag will be set in the Interrupt handler. */
    while((!g_bAESReadyFlag) && (count > 0))
    {
        count --;
    }
    if (count == 0)
    {
        return CryptoCC32XX_STATUS_ERROR;
    }

    /* Configure the AES module with direction (encryption or decryption) and  */
    /* the key size. */
    MAP_AESConfigSet(AES_BASE, cryptoDirection | cryptoMode | CryptoCC32XX_getAesKeySize(pParams->aes.keySize));

    /* Write the initial value registers if needed, depends on the mode. */
    if ((cryptoMode == AES_CFG_MODE_CBC) || (cryptoMode == AES_CFG_MODE_CFB) ||
        (cryptoMode == AES_CFG_MODE_CTR) || (cryptoMode == AES_CFG_MODE_ICM) ||
        (cryptoMode == AES_CFG_MODE_CCM) || (cryptoMode == AES_CFG_MODE_GCM_HY0CALC))
    {
        MAP_AESIVSet(AES_BASE, pParams->aes.pIV);
    }


    /* Write key1. */
    MAP_AESKey1Set(AES_BASE, (uint8_t *)pParams->aes.pKey,CryptoCC32XX_getAesKeySize(pParams->aes.keySize));

    /* Write key2. */
    if (cryptoMode == AES_CFG_MODE_CCM)
    {
        MAP_AESKey2Set(AES_BASE, pParams->aes.aadParams.input.pKey2, CryptoCC32XX_getAesKeySize(pParams->aes.aadParams.input.key2Size));
    }

    /* Start Crypt Process */
    if ((cryptoMode == AES_CFG_MODE_CCM) || (cryptoMode == AES_CFG_MODE_GCM_HY0CALC))
    {
        MAP_AESDataProcessAE(AES_BASE, (uint8_t *)(pInBuff+(pParams->aes.aadParams.input.len)), pOutBuff ,inLen, pInBuff, pParams->aes.aadParams.input.len, pParams->aes.aadParams.tag);

    }
    else
    {
        MAP_AESDataProcess(AES_BASE, pInBuff, pOutBuff, inLen);
    }

