runchip/zephyr-cc3220/ext/hal/ti/simplelink/source/ti/drivers/crypto/CryptoCC32XX.c
    /* Read the initial value registers if needed, depends on the mode. */
    if ((cryptoMode == AES_CFG_MODE_CBC) || (cryptoMode == AES_CFG_MODE_CFB) ||
        (cryptoMode == AES_CFG_MODE_CTR) || (cryptoMode == AES_CFG_MODE_ICM) ||
        (cryptoMode == AES_CFG_MODE_CCM) || (cryptoMode == AES_CFG_MODE_GCM_HY0CALC))
    {
        MAP_AESIVGet(AES_BASE, pParams->aes.pIV);
    }

    return CryptoCC32XX_STATUS_SUCCESS;

}

/*
 *  ======== CryptoCC32XX_desProcess ========
 */
int32_t CryptoCC32XX_desProcess(uint32_t cryptoMode , uint32_t cryptoDirection, uint8_t *pInBuff, uint16_t inLen, uint8_t *pOutBuff , CryptoCC32XX_EncryptParams *pParams)
{
    int32_t count = CryptoCC32XX_CONTEXT_READY_MAX_COUNTER;

    /*
    Step1:  Enable Interrupts
    Step2:  Wait for Context Ready Interrupt
    Step3:  Set the Configuration Parameters (Direction,AES Mode)
    Step4:  Set the Initialization Vector
    Step5:  Write Key
    Step6:  Start the Crypt Process
    */

    /* Clear the flag. */
    g_bDESReadyFlag = false;

    /* Enable all interrupts. */
    MAP_DESIntEnable(DES_BASE, DES_INT_CONTEXT_IN | DES_INT_DATA_IN | DES_INT_DATA_OUT);

    /* Wait for the context in flag. */
    while((!g_bDESReadyFlag) && (count > 0))
    {
        count --;
    }
    if (count == 0)
    {
        return CryptoCC32XX_STATUS_ERROR;
    }

    /* Configure the DES module. */
    MAP_DESConfigSet(DES_BASE, cryptoDirection | cryptoMode | CryptoCC32XX_getDesKeySize(pParams->des.keySize));

    /* Set the key. */
    MAP_DESKeySet(DES_BASE, (uint8_t *)pParams->des.pKey);

    /* Write the initial value registers if needed. */
    if((cryptoMode & DES_CFG_MODE_CBC) || (cryptoMode & DES_CFG_MODE_CFB))
    {
        MAP_DESIVSet(DES_BASE, pParams->des.pIV);
    }

    MAP_DESDataProcess(DES_BASE, pInBuff, pOutBuff,inLen);
    return CryptoCC32XX_STATUS_SUCCESS;
}


/*
 *  ======== CryptoCC32XX_aesIntHandler ========
 */
void CryptoCC32XX_aesIntHandler(void)
{
    uint32_t uiIntStatus;

    /* Read the AES masked interrupt status. */
    uiIntStatus = MAP_AESIntStatus(AES_BASE, true);

    /* Set Different flags depending on the interrupt source. */
    if(uiIntStatus & AES_INT_CONTEXT_IN)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_CONTEXT_IN);
        g_bAESReadyFlag = true;
    }
    if(uiIntStatus & AES_INT_DATA_IN)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_DATA_IN);
    }
    if(uiIntStatus & AES_INT_CONTEXT_OUT)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_CONTEXT_OUT);
    }
    if(uiIntStatus & AES_INT_DATA_OUT)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_DATA_OUT);
    }
}

/*
 *  ======== CryptoCC32XX_desIntHandler ========
 */
void CryptoCC32XX_desIntHandler(void)
{
    uint32_t ui32IntStatus;

    /* Read the DES masked interrupt status. */
    ui32IntStatus = MAP_DESIntStatus(DES_BASE, true);

    /* set flags depending on the interrupt source. */
    if(ui32IntStatus & DES_INT_CONTEXT_IN)
    {
        MAP_DESIntDisable(DES_BASE, DES_INT_CONTEXT_IN);
        g_bDESReadyFlag = true;
    }
    if(ui32IntStatus & DES_INT_DATA_IN)
    {
        MAP_DESIntDisable(DES_BASE, DES_INT_DATA_IN);
    }
    if(ui32IntStatus & DES_INT_DATA_OUT)
    {
        MAP_DESIntDisable(DES_BASE, DES_INT_DATA_OUT);
    }
}

/*
 *  ======== CryptoCC32XX_shamd5IntHandler ========
 */
void CryptoCC32XX_shamd5IntHandler(void)
{
    uint32_t ui32IntStatus;

    /* Read the SHA/MD5 masked interrupt status. */
    ui32IntStatus = MAP_SHAMD5IntStatus(SHAMD5_BASE, true);

    if(ui32IntStatus & SHAMD5_INT_CONTEXT_READY)
    {
        MAP_SHAMD5IntDisable(SHAMD5_BASE, SHAMD5_INT_CONTEXT_READY);
        g_bSHAMD5ReadyFlag = true;
    }
    if(ui32IntStatus & SHAMD5_INT_PARTHASH_READY)
    {
        MAP_SHAMD5IntDisable(SHAMD5_BASE, SHAMD5_INT_PARTHASH_READY);
    }
    if(ui32IntStatus & SHAMD5_INT_INPUT_READY)
    {
        MAP_SHAMD5IntDisable(SHAMD5_BASE, SHAMD5_INT_INPUT_READY);
    }
    if(ui32IntStatus & SHAMD5_INT_OUTPUT_READY)
    {
        MAP_SHAMD5IntDisable(SHAMD5_BASE, SHAMD5_INT_OUTPUT_READY);
    }
}

/*
 *  ======== CryptoCC32XX_register ========
 */
HwiP_Handle CryptoCC32XX_register(CryptoCC32XX_Handle handle, CryptoCC32XX_HwiP *hwiP)
{
    HwiP_Params             hwiParams;
    HwiP_Handle             hwiHandle = NULL;

    if (hwiP->hwiIntFxn != NULL)
    {
        /* Create Hwi object for this CryptoCC32XX peripheral. */
        HwiP_Params_init(&hwiParams);
        hwiParams.arg = (uintptr_t)handle;
        hwiParams.priority = hwiP->intPriority;
        hwiHandle = HwiP_create(hwiP->intNum, hwiP->hwiIntFxn,&hwiParams);
    }
    return hwiHandle;
}

/*
 *  ======== CryptoCC32XX_unregister ========
 */
void CryptoCC32XX_unregister(HwiP_Handle handle)
{
    if (handle != NULL)
    {
        /* Delete Hwi object */
        HwiP_delete(handle);
    }
}
